Revit 2027 API
BuiltInFailures.ForeignFileFailures.ForeignFile Property
 This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ForeignFile { get; }
Public Shared ReadOnly Property ForeignFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ForeignFile {
	FailureDefinitionId^ get ();
}
static member ForeignFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ForeignFileFailures Class
Autodesk.Revit.DB Namespace